Using the [example](https://registry.terraform.io/providers/microsoft/azuredevops/latest/docs/resources/group) for creating the `azuredevops_group` resource results in the same bug.

My terraform config:

```hcl
# https://registry.terraform.io/providers/microsoft/azuredevops/latest/docs/resources/group

terraform {
  required_providers {
    azuredevops = {
      source = "microsoft/azuredevops"
      version = ">=0.2.0"
    }
  }
}

provider "azuredevops" {
    org_service_url = "${var.ado_org_url}"
    personal_access_token = "${var.ado_pat}"
}

resource "azuredevops_project" "p" {
  name = "Test Project"
}

data "azuredevops_group" "tf-project-readers" {
  project_id = azuredevops_project.p.id
  name       = "Readers"
}

data "azuredevops_group" "tf-project-contributors" {
  project_id = azuredevops_project.p.id
  name       = "Contributors"
}

resource "azuredevops_group" "g" {
  scope        = azuredevops_project.p.id

  display_name = "Test group"
  description  = "Test description"

}
```

Here is the debug log:
```
2022-02-24T07:57:39.626+0100 [DEBUG] Adding temp file log sink: C:\Users\niehus\AppData\Local\Temp\terraform-log740887923
2022-02-24T07:57:39.660+0100 [INFO]  Terraform version: 0.15.1
2022-02-24T07:57:39.660+0100 [INFO]  Go runtime version: go1.16.2
2022-02-24T07:57:39.660+0100 [INFO]  CLI args: []string{"C:\\ProgramData\\chocolatey\\lib\\terraform\\tools\\terraform.exe", "apply"}
2022-02-24T07:57:39.663+0100 [DEBUG] Attempting to open CLI config file: C:\Users\niehus\AppData\Roaming\terraform.rc
2022-02-24T07:57:39.664+0100 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2022-02-24T07:57:39.666+0100 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2022-02-24T07:57:39.666+0100 [DEBUG] ignoring non-existing provider search directory C:\Users\niehus\AppData\Roaming\terraform.d\plugins
2022-02-24T07:57:39.668+0100 [DEBUG] ignoring non-existing provider search directory C:\Users\niehus\AppData\Roaming\HashiCorp\Terraform\plugins
2022-02-24T07:57:39.668+0100 [INFO]  CLI command args: []string{"apply"}
2022-02-24T07:57:39.673+0100 [DEBUG] New state was assigned lineage "5a028ecd-d99d-2992-57ca-04b4c1ec30f4"
2022-02-24T07:57:39.740+0100 [DEBUG] checking for provisioner in "."
2022-02-24T07:57:39.742+0100 [DEBUG] checking for provisioner in "C:\\ProgramData\\chocolatey\\lib\\terraform\\tools"
2022-02-24T07:57:39.743+0100 [INFO]  Failed to read plugin lock file .terraform\plugins\windows_amd64\lock.json: open .terraform\plugins\windows_amd64\lock.json: The system cannot find the path specified.
2022-02-24T07:57:39.743+0100 [INFO]  backend/local: starting Apply operation
2022-02-24T07:57:39.745+0100 [DEBUG] backend/local: will prompt for input of unset required variables [ado_org_url ado_pat]
2022-02-24T07:57:39.745+0100 [DEBUG] command: asking for input: "var.ado_org_url"
var.ado_org_url
  The URL for the ADO Org

  Enter a value: <redacted>

2022-02-24T07:57:43.393+0100 [DEBUG] command: asking for input: "var.ado_pat"
var.ado_pat
  The PAT for the ADO Org.

  Enter a value: <redacted>

2022-02-24T07:57:47.543+0100 [DEBUG] created provider logger: level=debug
2022-02-24T07:57:47.544+0100 [INFO]  provider: configuring client automatic mTLS
2022-02-24T07:57:47.586+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 args=[.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0]
2022-02-24T07:57:47.600+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=8816
2022-02-24T07:57:47.600+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0
2022-02-24T07:57:47.669+0100 [INFO]  provider.terraform-provider-azuredevops_v0.2.0: configuring server automatic mTLS: timestamp=2022-02-24T07:57:47.628+0100
2022-02-24T07:57:47.710+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: plugin address: network=tcp address=127.0.0.1:10000 timestamp=2022-02-24T07:57:47.709+0100
2022-02-24T07:57:47.710+0100 [DEBUG] provider: using plugin: version=5
2022-02-24T07:57:47.763+0100 [DEBUG] No provider meta schema returned
2022-02-24T07:57:47.768+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-02-24T07:57:47.786+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=8816
2022-02-24T07:57:47.786+0100 [DEBUG] provider: plugin exited
2022-02-24T07:57:47.786+0100 [INFO]  terraform: building graph: GraphTypeValidate
2022-02-24T07:57:47.787+0100 [DEBUG] ProviderTransformer: "azuredevops_project.p" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:47.788+0100 [DEBUG] ProviderTransformer: "azuredevops_group.g" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:47.788+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-readers" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:47.788+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-contributors" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "azuredevops_project.p" references: []
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "azuredevops_group.g" references: [azuredevops_project.p]
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-readers" references: [azuredevops_project.p]
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-contributors" references: [azuredevops_project.p]
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "var.ado_org_url" references: []
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "var.ado_pat" references: []
2022-02-24T07:57:47.788+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/microsoft/azuredevops\"]" references: [var.ado_pat var.ado_org_url]
2022-02-24T07:57:47.790+0100 [DEBUG] Starting graph walk: walkValidate
2022-02-24T07:57:47.791+0100 [DEBUG] created provider logger: level=debug
2022-02-24T07:57:47.791+0100 [INFO]  provider: configuring client automatic mTLS
2022-02-24T07:57:47.831+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 args=[.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0]
2022-02-24T07:57:47.851+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=20200
2022-02-24T07:57:47.851+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0
2022-02-24T07:57:47.920+0100 [INFO]  provider.terraform-provider-azuredevops_v0.2.0: configuring server automatic mTLS: timestamp=2022-02-24T07:57:47.880+0100
2022-02-24T07:57:47.958+0100 [DEBUG] provider: using plugin: version=5
2022-02-24T07:57:47.958+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: plugin address: address=127.0.0.1:10000 network=tcp timestamp=2022-02-24T07:57:47.958+0100
2022-02-24T07:57:48.009+0100 [DEBUG] No provider meta schema returned
2022-02-24T07:57:48.021+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-02-24T07:57:48.034+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=20200
2022-02-24T07:57:48.034+0100 [DEBUG] provider: plugin exited
2022-02-24T07:57:48.034+0100 [INFO]  backend/local: apply calling Plan
2022-02-24T07:57:48.034+0100 [INFO]  terraform: building graph: GraphTypePlan
2022-02-24T07:57:48.036+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-readers (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:48.036+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-contributors (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:48.036+0100 [DEBUG] ProviderTransformer: "azuredevops_group.g (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:48.036+0100 [DEBUG] ProviderTransformer: "azuredevops_project.p (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-readers (expand)" references: [azuredevops_project.p (expand)]
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-contributors (expand)" references: [azuredevops_project.p (expand)]
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "var.ado_org_url" references: []
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "var.ado_pat" references: []
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/microsoft/azuredevops\"]" references: [var.ado_org_url var.ado_pat]
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "azuredevops_group.g (expand)" references: [azuredevops_project.p (expand)]
2022-02-24T07:57:48.037+0100 [DEBUG] ReferenceTransformer: "azuredevops_project.p (expand)" references: []
2022-02-24T07:57:48.039+0100 [DEBUG] Starting graph walk: walkPlan
2022-02-24T07:57:48.039+0100 [DEBUG] created provider logger: level=debug
2022-02-24T07:57:48.039+0100 [INFO]  provider: configuring client automatic mTLS
2022-02-24T07:57:48.092+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 args=[.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0]
2022-02-24T07:57:48.103+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=7340
2022-02-24T07:57:48.103+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0
2022-02-24T07:57:48.161+0100 [INFO]  provider.terraform-provider-azuredevops_v0.2.0: configuring server automatic mTLS: timestamp=2022-02-24T07:57:48.127+0100
2022-02-24T07:57:48.197+0100 [DEBUG] provider: using plugin: version=5
2022-02-24T07:57:48.197+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: plugin address: address=127.0.0.1:10000 network=tcp timestamp=2022-02-24T07:57:48.197+0100
2022-02-24T07:57:48.277+0100 [DEBUG] No provider meta schema returned
2022-02-24T07:57:48.294+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:48 [DEBUG] AzureRM Client User Agent: terraform-provider-azuredevops/v0.2.0
2022-02-24T07:57:48.657+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:48 getAzdoClient(): Created core, build, operations, and serviceendpoint clients successfully!
2022-02-24T07:57:48.657+0100 [DEBUG] Resource instance state not found for node "azuredevops_project.p", instance azuredevops_project.p
2022-02-24T07:57:48.658+0100 [DEBUG] ReferenceTransformer: "azuredevops_project.p" references: []
2022-02-24T07:57:48.658+0100 [DEBUG] refresh: azuredevops_project.p: no state, so not refreshing
2022-02-24T07:57:48.660+0100 [WARN]  Provider "registry.terraform.io/microsoft/azuredevops" produced an invalid plan for azuredevops_project.p, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .version_control: planned value cty.StringVal("git") for a non-computed attribute
      - .visibility: planned value cty.StringVal("private") for a non-computed attribute
      - .work_item_template: planned value cty.StringVal("Agile") for a non-computed attribute
2022-02-24T07:57:48.660+0100 [DEBUG] Resource instance state not found for node "data.azuredevops_group.tf-project-readers", instance data.azuredevops_group.tf-project-readers
2022-02-24T07:57:48.660+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-readers" references: []
2022-02-24T07:57:48.660+0100 [DEBUG] Resource instance state not found for node "data.azuredevops_group.tf-project-contributors", instance data.azuredevops_group.tf-project-contributors      
2022-02-24T07:57:48.661+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-contributors" references: []
2022-02-24T07:57:48.661+0100 [DEBUG] Resource instance state not found for node "azuredevops_group.g", instance azuredevops_group.g
2022-02-24T07:57:48.661+0100 [DEBUG] ReferenceTransformer: "azuredevops_group.g" references: []
2022-02-24T07:57:48.661+0100 [DEBUG] refresh: azuredevops_group.g: no state, so not refreshing
2022-02-24T07:57:48.665+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-02-24T07:57:48.678+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=7340
2022-02-24T07:57:48.678+0100 [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azuredevops_group.tf-project-contributors will be read during apply
  # (config refers to values not yet known)
 <= data "azuredevops_group" "tf-project-contributors"  {
      + descriptor = (known after apply)
      + id         = (known after apply)
      + name       = "Contributors"
      + origin     = (known after apply)
      + origin_id  = (known after apply)
      + project_id = (known after apply)
    }

  # data.azuredevops_group.tf-project-readers will be read during apply
  # (config refers to values not yet known)
 <= data "azuredevops_group" "tf-project-readers"  {
      + descriptor = (known after apply)
      + id         = (known after apply)
      + name       = "Readers"
      + origin     = (known after apply)
      + origin_id  = (known after apply)
      + project_id = (known after apply)
    }

  # azuredevops_group.g will be created
  + resource "azuredevops_group" "g" {
      + description    = "Test description"
      + descriptor     = (known after apply)
      + display_name   = "Test group"
      + domain         = (known after apply)
      + id             = (known after apply)
      + mail           = (known after apply)
      + members        = (known after apply)
      + origin         = (known after apply)
      + origin_id      = (known after apply)
      + principal_name = (known after apply)
      + scope          = (known after apply)
      + subject_kind   = (known after apply)
      + url            = (known after apply)
    }

  # azuredevops_project.p will be created
  + resource "azuredevops_project" "p" {
      + id                  = (known after apply)
      + name                = "Test Project"
      + process_template_id = (known after apply)
      + version_control     = "git"
      + visibility          = "private"
      + work_item_template  = "Agile"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
2022-02-24T07:57:48.689+0100 [DEBUG] command: asking for input: "\nDo you want to perform these actions?"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2022-02-24T07:57:51.345+0100 [INFO]  backend/local: apply calling Apply
2022-02-24T07:57:51.345+0100 [INFO]  terraform: building graph: GraphTypeApply
2022-02-24T07:57:51.346+0100 [DEBUG] Resource state not found for node "azuredevops_project.p", instance azuredevops_project.p
2022-02-24T07:57:51.346+0100 [DEBUG] Resource state not found for node "azuredevops_group.g", instance azuredevops_group.g
2022-02-24T07:57:51.346+0100 [DEBUG] Resource state not found for node "data.azuredevops_group.tf-project-contributors", instance data.azuredevops_group.tf-project-contributors
2022-02-24T07:57:51.346+0100 [DEBUG] Resource state not found for node "data.azuredevops_group.tf-project-readers", instance data.azuredevops_group.tf-project-readers
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "azuredevops_project.p" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/microsoft/azuredevops"]     
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "azuredevops_group.g" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/microsoft/azuredevops"]       
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "azuredevops_project.p (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "azuredevops_group.g (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-contributors" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-readers" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-contributors (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ProviderTransformer: "data.azuredevops_group.tf-project-readers (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/microsoft/azuredevops"]
2022-02-24T07:57:51.346+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-contributors (expand)" references: []
2022-02-24T07:57:51.346+0100 [DEBUG] ReferenceTransformer: "var.ado_pat" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-contributors" references: [azuredevops_project.p (expand) azuredevops_project.p azuredevops_project.p]
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-readers" references: [azuredevops_project.p (expand) azuredevops_project.p azuredevops_project.p]
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "azuredevops_project.p (expand)" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "azuredevops_group.g (expand)" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "data.azuredevops_group.tf-project-readers (expand)" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "var.ado_org_url" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "azuredevops_project.p" references: []
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "azuredevops_group.g" references: [azuredevops_project.p (expand) azuredevops_project.p azuredevops_project.p]
2022-02-24T07:57:51.347+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/microsoft/azuredevops\"]" references: [var.ado_org_url var.ado_pat]
2022-02-24T07:57:51.348+0100 [DEBUG] Starting graph walk: walkApply
2022-02-24T07:57:51.349+0100 [DEBUG] created provider logger: level=debug
2022-02-24T07:57:51.349+0100 [INFO]  provider: configuring client automatic mTLS
2022-02-24T07:57:51.383+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 args=[.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0]
2022-02-24T07:57:51.396+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=30472
2022-02-24T07:57:51.396+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0
2022-02-24T07:57:51.458+0100 [INFO]  provider.terraform-provider-azuredevops_v0.2.0: configuring server automatic mTLS: timestamp=2022-02-24T07:57:51.422+0100
2022-02-24T07:57:51.495+0100 [DEBUG] provider: using plugin: version=5
2022-02-24T07:57:51.495+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: plugin address: address=127.0.0.1:10000 network=tcp timestamp=2022-02-24T07:57:51.495+0100
2022-02-24T07:57:51.545+0100 [DEBUG] No provider meta schema returned
2022-02-24T07:57:51.553+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:51 [DEBUG] AzureRM Client User Agent: terraform-provider-azuredevops/v0.2.0
2022-02-24T07:57:51.835+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:51 getAzdoClient(): Created core, build, operations, and serviceendpoint clients successfully!
2022-02-24T07:57:51.838+0100 [WARN]  Provider "registry.terraform.io/microsoft/azuredevops" produced an invalid plan for azuredevops_project.p, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .version_control: planned value cty.StringVal("git") for a non-computed attribute
      - .visibility: planned value cty.StringVal("private") for a non-computed attribute
      - .work_item_template: planned value cty.StringVal("Agile") for a non-computed attribute
azuredevops_project.p: Creating...
2022-02-24T07:57:51.839+0100 [INFO]  Starting apply for azuredevops_project.p
2022-02-24T07:57:51.839+0100 [DEBUG] azuredevops_project.p: applying the planned Create change
2022-02-24T07:57:52.043+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:52 [DEBUG] Waiting for state to become: [failed succeeded cancelled]
2022-02-24T07:57:57.088+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:57 [DEBUG] Waiting for state to become: [success]
2022-02-24T07:57:57.248+0100 [WARN]  Provider "provider[\"registry.terraform.io/microsoft/azuredevops\"]" produced an unexpected new value for azuredevops_project.p, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .version_control: was cty.StringVal("git"), but now cty.StringVal("Git")
      - .description: was null, but now cty.StringVal("")
azuredevops_project.p: Creation complete after 5s [id=ca773d4f-9654-47cf-b3a6-025e63757c78]
data.azuredevops_group.tf-project-contributors: Reading...
data.azuredevops_group.tf-project-readers: Reading...
2022-02-24T07:57:57.256+0100 [WARN]  Provider "registry.terraform.io/microsoft/azuredevops" produced an invalid plan for azuredevops_group.g, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .scope: planned value cty.NullVal(cty.String) does not match config value cty.StringVal("ca773d4f-9654-47cf-b3a6-025e63757c78")
azuredevops_group.g: Creating...
2022-02-24T07:57:57.256+0100 [INFO]  Starting apply for azuredevops_group.g
2022-02-24T07:57:57.257+0100 [DEBUG] azuredevops_group.g: applying the planned Create change
2022-02-24T07:57:57.258+0100 [DEBUG] provider.terraform-provider-azuredevops_v0.2.0: 2022/02/24 07:57:57 [DEBUG] setting computed for "members" from ComputedKeys
data.azuredevops_group.tf-project-contributors: Read complete after 1s [id=vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjEwMTQ5NDYwNi05MjAyNDk2NzgtMjc2NTg2NjU4OC0xNDUwNDI2MTAw]
data.azuredevops_group.tf-project-readers: Read complete after 1s [id=vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjcyNjYwODI4OC0xODI5NzkzMzQ3LTI5MTE5ODEwMDMtNDI3OTU3NDQ5Nw]
azuredevops_group.g: Creation complete after 1s [id=vssgp.Uy0xLTktMTU1MTM3NDI0NS0zNTE4MTU0MDAxLTExNTc5Njk0NzYtMzA3OTIxNTkyNC02NTg0ODExNDMtMS00MDkwOTU5Mjg5LTkwOTg0MjI0NC0yNjMwOTI5MTYwLTQxNjYyODc3NjQ]
2022-02-24T07:57:58.155+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-02-24T07:57:58.182+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/microsoft/azuredevops/0.2.0/windows_amd64/terraform-provider-azuredevops_v0.2.0 pid=30472
2022-02-24T07:57:58.182+0100 [DEBUG] provider: plugin exited
```

and here is the resulting tfstate:
```json
{
  "version": 4,
  "terraform_version": "0.15.1",
  "serial": 5,
  "lineage": "6f488743-fb70-4b23-87c0-f4980cf1a8dc",
  "outputs": {},
  "resources": [
    {
      "mode": "data",
      "type": "azuredevops_group",
      "name": "tf-project-contributors",
      "provider": "provider[\"registry.terraform.io/microsoft/azuredevops\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "descriptor": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjEwMTQ5NDYwNi05MjAyNDk2NzgtMjc2NTg2NjU4OC0xNDUwNDI2MTAw",
            "id": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjEwMTQ5NDYwNi05MjAyNDk2NzgtMjc2NTg2NjU4OC0xNDUwNDI2MTAw",
            "name": "Contributors",
            "origin": "vsts",
            "origin_id": "05f13622-6d33-41ed-bb02-f736ebfd19f5",
            "project_id": "ca773d4f-9654-47cf-b3a6-025e63757c78"
          },
          "sensitive_attributes": []
        }
      ]
    },
    {
      "mode": "data",
      "type": "azuredevops_group",
      "name": "tf-project-readers",
      "provider": "provider[\"registry.terraform.io/microsoft/azuredevops\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "descriptor": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjcyNjYwODI4OC0xODI5NzkzMzQ3LTI5MTE5ODEwMDMtNDI3OTU3NDQ5Nw",
            "id": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0xMzI5NDI4NDI2LTE0MTkxNjk2MDctMzAxNDAwMTI0Ni0xNjY4NjQzOTYwLTEtMjcyNjYwODI4OC0xODI5NzkzMzQ3LTI5MTE5ODEwMDMtNDI3OTU3NDQ5Nw",
            "name": "Readers",
            "origin": "vsts",
            "origin_id": "6a23f8bc-51cd-4abf-92ad-50f52e1a8ffa",
            "project_id": "ca773d4f-9654-47cf-b3a6-025e63757c78"
          },
          "sensitive_attributes": []
        }
      ]
    },
    {
      "mode": "managed",
      "type": "azuredevops_group",
      "name": "g",
      "provider": "provider[\"registry.terraform.io/microsoft/azuredevops\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "description": "Test description",
            "descriptor": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0zNTE4MTU0MDAxLTExNTc5Njk0NzYtMzA3OTIxNTkyNC02NTg0ODExNDMtMS00MDkwOTU5Mjg5LTkwOTg0MjI0NC0yNjMwOTI5MTYwLTQxNjYyODc3NjQ",
            "display_name": "Test group",
            "domain": "vstfs:///Framework/IdentityDomain/11c5b2d1-0545-4436-b789-1b34273f9ff7",
            "id": "vssgp.Uy0xLTktMTU1MTM3NDI0NS0zNTE4MTU0MDAxLTExNTc5Njk0NzYtMzA3OTIxNTkyNC02NTg0ODExNDMtMS00MDkwOTU5Mjg5LTkwOTg0MjI0NC0yNjMwOTI5MTYwLTQxNjYyODc3NjQ",
            "mail": null,
            "members": [],
            "origin": "vsts",
            "origin_id": "c65df31d-27c2-45c3-a56b-346164f1d82d",
            "principal_name": "[<redacted>]\\Test group",
            "scope": null,
            "subject_kind": "group",
            "url": "https://vssps.dev.azure.com/<redacted>/_apis/Graph/Groups/vssgp.Uy0xLTktMTU1MTM3NDI0NS0zNTE4MTU0MDAxLTExNTc5Njk0NzYtMzA3OTIxNTkyNC02NTg0ODExNDMtMS00MDkwOTU5Mjg5LTkwOTg0MjI0NC0yNjMwOTI5MTYwLTQxNjYyODc3NjQ"
          },
          "sensitive_attributes": [],
          "private": "<redacted>",
          "dependencies": [
            "azuredevops_project.p"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "azuredevops_project",
      "name": "p",
      "provider": "provider[\"registry.terraform.io/microsoft/azuredevops\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "description": "",
            "features": null,
            "id": "ca773d4f-9654-47cf-b3a6-025e63757c78",
            "name": "Test Project",
            "process_template_id": "adcc42ab-9882-485e-a3ed-7678f01f66bc",
            "timeouts": null,
            "version_control": "Git",
            "visibility": "private",
            "work_item_template": "Agile"
          },
          "sensitive_attributes": [],
          "private": "<redacted>"
        }
      ]
    }
  ]
}
```